Revit 2027 API
BuiltInFailures.DesignOptionFailures.AreaTagLineCannotBeInDesignOption Property
 Areas and Area Boundaries are not allowed in Design Options. Make an Area Scheme and an Area Plan for this Option then draw all Areas and Area Boundaries in that view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaTagLineCannotBeInDesignOption { get; }
Public Shared ReadOnly Property AreaTagLineCannotBeInDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaTagLineCannotBeInDesignOption {
	FailureDefinitionId^ get ();
}
static member AreaTagLineCannotBeInDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace